src/init.org
#+TITLE: Virtual Lisp Machine
#+AUTHOR: lambdart eirc.m
#+EMAIL: lambdart@protonmail.com eirc.m@protonmail.com
#+DESCRIPTION: an org-mode based Emacs configuration
#+KEYWORDS: emacs, org, liretate programming, config, init.el
#+LANGUAGE: en
#+BABEL: :cache yes
#+PROPERTY: header-args :tangle yes
#+STARTUP: showall

* Simplified VLM

  This is a cutomization I did over the inumerous refactoring that we
  need to reconfigure the whole system. Over the years, I changed from
  one Operational System to another in order to achieve the best usability
  for me. But since we also need to adapt to the commercial software due
  our capitalist needs, it's very hard to keep both worlds in sync.

  This is a simplified version of the VLM in order to start from scratch.
  It became easier for me start from zero instead of trying to adapt all
  other pieces of Elisp code or programs used by emacs once it became
  complex and full of features. For every new reconfiguration, a new set
  of configuration is created or updated, creating a whole new environment.

  This is the common start point for me.

* VLM

  Some people (including me) have started to refer to
  =Emacs= as a =LISP MACHINE=. It is not strictly a lisp machine
  because, clearly, it is a software program and not a physical
  computer, but as that line starts to blur it seems like a useful
  epithet for =Emacs=, because these days it looks more and more like
  an operating system.

  A =Lisp Machine= is a generic term. A Lisp Machine is a
  computer whose operating system and applications are
  written in Lisp.

  So, =VLM= stands for =Virtual Lisp Machine= and the prefix
  =vlm-= will appear often through this document.

  Literate programming is a programming paradigm introduced by Donald
  Knuth  in which a computer program is given an explanation of its
  logic in a natural language, such as English, interspersed with
  snippets of macros and traditional source code, from which
  compilable source code can be generated.

  =Org-mode= is used to write and organize the configuration
  in a literate programming format, meaning it contains
  Elisp source code blocks - that will be tangled generating the
  =init.el= final script - and the referent documentation.

  When you start Emacs, it normally attempts to load
  your =init.el file=, that will =load*= and =set= the
  proper values to the customizable library's variables.

** Bootstrap
*** Header

    Define the package header to avoid warnings, and just a
    reminder this file will be used as a seed to generate the
    final ~init.el~ script.

    #+BEGIN_SRC emacs-lisp

    ;;; init.el --- Virtual Lisp Machine Configuration (init.el)

    ;;; Commentary:

    ;; ... Present day, present time ....

    ;;; Code:

    #+END_SRC

*** Lexical

    Lexical binding opens up many more opportunities
    for optimization, so programs using it are likely to run
    faster in future Emacs versions.

    Lexical binding is also more compatible with concurrency,
    which was added to Emacs in version 26.1.

    #+BEGIN_SRC emacs-lisp

    ;;; -*- lexical-binding: t -*-

    #+END_SRC

*** Verify
**** Version

     Verify Emacs version.

     #+BEGIN_SRC emacs-lisp

     (when (version< emacs-version "26.3")
       (error "This requires Emacs 26.3 and above!"))

     #+END_SRC

*** Load-path

    When Emacs loads a Lisp library, it searches for the library in a list
    of directories specified by the variable 'load-path'. The value
    of this variable is a list of directories to search when
    loading files.

    If the environment variable =EMACSLOADPATH= is set, it modifies the
    above initialization procedure. Emacs initializes `load-path' based on
    the value of the environment variable.

    The syntax of =EMACSLOADPATH= is the same as used for 'PATH';
    directories are separated by ':' (or ';', on some operating systems).
    Here is an example of how to set =EMACSLOADPATH= variable (from a
    'sh'-style shell).

    #+BEGIN_SRC sh

    export EMACSLOADPATH=$EMACSLOADPATH:~/.emacs.d/lisp:~/.emacs.d/site-lisp

    #+END_SRC

    See ~defaults/default.xinitrc~ file for a detailed example.

    For each directory in `load-path', Emacs then checks to see if it
    contains a file `subdirs.el', and if so, loads it. The `subdirs.el'
    file is created when Emacs is built/installed, and contains code that
    causes Emacs to add any subdirectories of those directories to
    `load-path'. Both immediate subdirectories and subdirectories multiple
    levels down are added. But it excludes subdirectories whose names do
    not start with a letter or digit, and subdirectories named 'RCS' or
    'CVS', and subdirectories containing a file named =.nosearch=.

    See ~defaults/default.subdir.el~ file example.

*** Load-prefer

    In noninteractive sessions, prioritize non-byte-compiled source files to
    prevent the use of stale byte-code. Otherwise, it saves us a little IO time
    to skip the mtime checks on every *.elc file.

    #+BEGIN_SRC emacs-lisp

    (setq load-prefer-newer noninteractive)

    #+END_SRC

*** Loaddefs

    Loaddefs.el, automatically extracted autoloads!

    Just load the definitions using the =autoloads= facility
    (=loaddefs.el=), speeding up the process of initialization,
    that's why most of the =(require '<library>)= are commented
    through this configuration.

    The =autoload= facility lets you register the existence of a function or
    macro, but put off loading the file that defines it. The first call to
    the function automatically loads the proper library, in order to install
    the real definition and other associated code, then runs the real
    definition as if it had been loaded all along (lazy-load).

    Instead of installing a function by loading the file that contains it,
    or by evaluating the function definition, you can make the function
    available but not actually install it until it is first called.  This is
    called =autoloading=.

    When you execute an autoloaded function, Emacs automatically
    evaluates the file that contains the definition, and then calls the
    function.

    #+BEGIN_SRC emacs-lisp
      (require 'cl-seq)

      (defun vlm/generate-dir-loaddefs (dir &optional generate-full)
        "Generate loaddefs file for all directories inside of `user-emacs-directory/lisp'.
      If called interactively, regenerate all loaddefs."
        (let* ((dir (expand-file-name dir))
               (dir-name (car (reverse (string-split dir "/" 't))))
               (outputfile (format "%s/%s-loaddefs.el" dir dir-name)))
          (message (format "Generating loaddefs for %s into %s..." dir outputfile))
          (loaddefs-generate
           (cl-remove-if-not #'file-directory-p (directory-files-recursively dir "^[^.]" t))
           (expand-file-name outputfile dir) nil nil nil generate-full)
          (when generate-full
            (message "Fully generated new loaddefs file"))))

      (defun vlm/generate-loaddefs (dir &optional)
        (interactive "DDirectory:")
        (vlm/generate-dir-loaddefs dir))
    #+END_SRC

***** Require

      #+BEGIN_SRC emacs-lisp

      (require 'loaddefs)

      #+END_SRC

*** Add dirs to load path
**** Macros

    #+BEGIN_SRC emacs-lisp
      (defmacro safe-load-file (file)
        "Load FILE if exists."
        `(if (not (file-exists-p ,file))
             (message "File not found")
           (load (expand-file-name ,file) t nil nil)))

      (defmacro safe-add-dirs-to-load-path (dirs)
        "Add DIRS (directories) to `load-path'."
        `(dolist (dir ,dirs)
           (setq dir (expand-file-name dir))
           (when (file-directory-p dir)
             (unless (member dir load-path)
               (push dir load-path)))))

      (defmacro safe-funcall (func &rest args)
        "Call FUNC with ARGS, if it's bounded."
        `(when (fboundp ,func)
           (funcall ,func ,@args)))

      (defmacro safe-mkdir (dir)
        "Create DIR in the file system."
        `(when (and (not (file-exists-p ,dir))
                    (make-directory ,dir :parents))))
    #+END_SRC

**** Interactive Call

    #+BEGIN_SRC emacs-lisp

      (defun add-dir-to-load-path (dir)
        "Add dir to load-path interactively."
        (interactive "DDirectory:")
        (safe-add-dirs-to-load-path (list dir)))

    #+END_SRC

*** GC

    A big contributor to startup times is garbage collection. We up the gc
    threshold to temporarily prevent it from running, then reset it later by
    enabling `gcmh-mode'. Not resetting it will cause stuttering/freezes.

    Enforce a sneaky Garbage Collection strategy
    to minimize GC interference with the activity.

**** Customize

     #+BEGIN_SRC emacs-lisp

     ;; threshold inital value
     (setq gc-cons-threshold most-positive-fixnum) ; 2^61 bytes

     #+END_SRC

*** Defines

    Your definitions as declare here. We have some
    =aliases=, =variables=, =keymaps= and =binds=.

**** Aliases

     Define some aliases to improve quality of life.

     #+BEGIN_SRC emacs-lisp

     ;; yes or no
     (defalias 'yes-or-no-p 'y-or-n-p)

     #+END_SRC

**** Variables

     Save =file-name-handle-alist=, it will be used to restore
     its original value. It might need to open a file while the startup,
     it's better for our usability to start with t he original value after
     the initialization.

     #+BEGIN_SRC emacs-lisp

     (defvar saved-file-name-handler-alist
       file-name-handler-alist
       "Save `file-name-handler-alist' variable.")

     #+END_SRC

**** Keymaps

     Basically, new prefix maps are created for the most commonly used
     commands and their functions are mapped within their respective maps.

     After that, the prefix maps will be placed in the Ctl-x-map
     prefix, resulting in the standardization of commands (functions)
     access sequences - keybinds or chords.

     For the sake of sanity a lot of keybinds have been cleaned up,
     it's preferable (IMO) to have a small set of keybinds,
     consisting only of the most used ones, providing a more stable
     and less error prone overall usability.

     #+BEGIN_SRC emacs-lisp

     (defvar vlm-window-map
       (make-sparse-keymap)
       "Window commands keymap.")

     (defvar vlm-rb-map
       (make-sparse-keymap)
       "Register/Bookmarks commands keymap.")

     (defvar vlm-tags-map
       (make-sparse-keymap)
       "Tags (navigation) commands keymap.")

     (defvar vlm-tabs-map
       (make-sparse-keymap)
       "Tabs (navigation) commands keymap.")

     (defvar vlm-pm-map
       (make-sparse-keymap)
       "Project management commands keymap.")

     (defvar vlm-sc-map
       (make-sparse-keymap)
       "Syntax check commands keymap.")

     (defvar vlm-completion-map
       (make-sparse-keymap)
       "Completion commands keymap.")

     (defvar vlm-docs-map
       (make-sparse-keymap)
       "Docs commands keymap.")

     (defvar vlm-files-map
       (make-sparse-keymap)
       "Files commands keymap.")

     (defvar vlm-debug-map
       (make-sparse-keymap)
       "Debug commands keymap.")

     (defvar vlm-filter-map
       (make-sparse-keymap)
       "Filter commands keymap.")

     (defvar vlm-utils-map
       (make-sparse-keymap)
       "Utils commands keymap.")

     (defvar vlm-media-map
       (make-sparse-keymap)
       "Media commands keymap.")

     #+END_SRC

     #+RESULTS:
     : vlm-media-map

     Define maps as prefix commands, this prepares
     =keymaps= for use as a prefix key's binding.

     #+BEGIN_SRC emacs-lisp

     (dolist (prefix-map '(vlm-tags-map
                           vlm-tabs-map
                           vlm-rb-map
                           vlm-pm-map
                           vlm-sc-map
                           vlm-docs-map
                           vlm-files-map
                           vlm-filter-map
                           vlm-utils-map
                           vlm-window-map
                           vlm-media-map
                           vlm-completion-map))
       (define-prefix-command prefix-map))

     #+END_SRC

