src/init.el
;;; init.el --- Virtual Lisp Machine Configuration (init.el)

;;; Commentary:

;; ... Present day, present time ....

;;; Code:

;;; -*- lexical-binding: t -*-

(when (version< emacs-version "26.3")
  (error "This requires Emacs 26.3 and above!"))

(setq load-prefer-newer noninteractive)

(require 'cl-seq)

(defun vlm/generate-dir-loaddefs (dir &optional generate-full)
  "Generate loaddefs file for all directories inside of `user-emacs-directory/lisp'.
If called interactively, regenerate all loaddefs."
  (let* ((dir (expand-file-name dir))
         (dir-name (car (reverse (string-split dir "/" 't))))
         (outputfile (format "%s/%s-loaddefs.el" dir dir-name)))
    (message (format "Generating loaddefs for %s into %s..." dir outputfile))
    (loaddefs-generate
     (cl-remove-if-not #'file-directory-p (directory-files-recursively dir "^[^.]" t))
     (expand-file-name outputfile dir) nil nil nil generate-full)
    (when generate-full
      (message "Fully generated new loaddefs file"))))

(defun vlm/generate-loaddefs (dir &optional)
  (interactive "DDirectory:")
  (vlm/generate-dir-loaddefs dir))

(require 'loaddefs)

(defmacro safe-load-file (file)
  "Load FILE if exists."
  `(if (not (file-exists-p ,file))
       (message "File not found")
     (load (expand-file-name ,file) t nil nil)))

(defmacro safe-add-dirs-to-load-path (dirs)
  "Add DIRS (directories) to `load-path'."
  `(dolist (dir ,dirs)
     (setq dir (expand-file-name dir))
     (when (file-directory-p dir)
       (unless (member dir load-path)
         (push dir load-path)))))

(defmacro safe-funcall (func &rest args)
  "Call FUNC with ARGS, if it's bounded."
  `(when (fboundp ,func)
     (funcall ,func ,@args)))

(defmacro safe-mkdir (dir)
  "Create DIR in the file system."
  `(when (and (not (file-exists-p ,dir))
              (make-directory ,dir :parents))))

(defun add-dir-to-load-path (dir)
  "Add dir to load-path."
  (interactive "DDirectory:")
  (safe-add-dirs-to-load-path (list dir)))

(safe-add-dirs-to-load-path '("~/.emacs.d/lisp/magit/lisp"))

;; threshold inital value
(setq gc-cons-threshold most-positive-fixnum) ; 2^61 bytes

;; yes or no
(defalias 'yes-or-no-p 'y-or-n-p)

(defvar saved-file-name-handler-alist
  file-name-handler-alist
  "Save `file-name-handler-alist' variable.")

(defvar vlm-window-map
  (make-sparse-keymap)
  "Window commands keymap.")

(defvar vlm-rb-map
  (make-sparse-keymap)
  "Register/Bookmarks commands keymap.")

(defvar vlm-tags-map
  (make-sparse-keymap)
  "Tags (navigation) commands keymap.")

(defvar vlm-tabs-map
  (make-sparse-keymap)
  "Tabs (navigation) commands keymap.")

(defvar vlm-pm-map
  (make-sparse-keymap)
  "Project management commands keymap.")

(defvar vlm-sc-map
  (make-sparse-keymap)
  "Syntax check commands keymap.")

(defvar vlm-completion-map
  (make-sparse-keymap)
  "Completion commands keymap.")

(defvar vlm-docs-map
  (make-sparse-keymap)
  "Docs commands keymap.")

(defvar vlm-files-map
  (make-sparse-keymap)
  "Files commands keymap.")

(defvar vlm-debug-map
  (make-sparse-keymap)
  "Debug commands keymap.")

(defvar vlm-filter-map
  (make-sparse-keymap)
  "Filter commands keymap.")

(defvar vlm-utils-map
  (make-sparse-keymap)
  "Utils commands keymap.")

(defvar vlm-media-map
  (make-sparse-keymap)
  "Media commands keymap.")

(dolist (prefix-map '(vlm-tags-map
                      vlm-tabs-map
                      vlm-rb-map
                      vlm-pm-map
                      vlm-sc-map
                      vlm-docs-map
                      vlm-files-map
                      vlm-filter-map
                      vlm-utils-map
                      vlm-window-map
                      vlm-media-map
                      vlm-completion-map))
  (define-prefix-command prefix-map))

;; vlm prefix maps
