src/init.org
**** Binds

     All the new created =keymaps= are bound
     to =ctl-x-map= prefix.

     #+BEGIN_SRC emacs-lisp

     ;; vlm prefix maps
     (define-key ctl-x-map (kbd "f") 'vlm-files-map) ;; files
     ;; (define-key ctl-x-map (kbd "") 'vlm-filter-map)
     (define-key ctl-x-map (kbd "p") 'vlm-pm-map) ; project
     (define-key ctl-x-map (kbd "t") 'vlm-tags-map) ; tags
     (define-key ctl-x-map (kbd "C-o") 'vlm-tabs-map) ; tabs
     (define-key ctl-x-map (kbd "c") 'vlm-utils-map) ; commands
     (define-key ctl-x-map (kbd "e") 'vlm-sc-map) ; errors
     (define-key ctl-x-map (kbd "l") 'vlm-docs-map) ; library
     (define-key ctl-x-map (kbd "v") 'vlm-media-map) ; video/media
     (define-key ctl-x-map (kbd "<tab>") 'vlm-completion-map) ; tab (complete)

     #+END_SRC

     #+RESULTS:
     : vlm-completion-map

**** Theme

    #+BEGIN_SRC emacs-lisp
      ;; add vlm-theme-dir to theme load path
      (add-to-list 'custom-theme-load-path
                   (concat user-emacs-directory "themes"))
      (load-theme 'moebius-glass t)
     #+END_SRC

*** Defer

    Used to seep up the emacs startup time.

**** Clean

     #+BEGIN_SRC emacs-lisp

     ;; clean file-name-handler-alist
     (setq file-name-handler-alist nil)

     #+END_SRC

**** Hooks

    Queue a hook to restore the file-name-handler-alist to that it was before this initialization.

     #+BEGIN_SRC emacs-lisp

     ;; restore file-name-handler-alist
     (add-hook 'emacs-startup-hook
               (lambda ()
                 (setq file-name-handler-alist
                       saved-file-name-handler-alist)))

     #+END_SRC

*** Startup

    This file parses the command line and gets Emacs running.

**** Customize

     #+BEGIN_SRC emacs-lisp

     ;; non-nil inhibits the startup screen
     (customize-set-variable 'inhibit-startup-message nil)

     ;; non-nil inhibits the initial startup echo area message
     (customize-set-variable 'inhibit-startup-echo-area-message nil)

     ;; major mode command symbol to use for the initial *scratch* buffer
     (customize-set-variable 'initial-major-mode 'emacs-lisp-mode)

     ;; the full name of the user logged in
     (customize-set-variable 'user-full-name (getenv "USER"))

     ;; email address of the current user
     (customize-set-variable 'user-mail-address "menezes.n.eric@gmail.com")

     #+END_SRC

*** Warnings

    This package implements the entry points `warn', `lwarn'
    and `display-warning'.

***** Require

      #+BEGIN_SRC emacs-lisp

      ;; (require 'warnings nil t)

      #+END_SRC

***** Customize

      #+BEGIN_SRC emacs-lisp

      ;; minimum severity level for displaying the warning buffer
      (customize-set-variable 'warning-minimum-level :error)

      ;; minimum severity level for logging a warning.
      (customize-set-variable 'warning-minimum-log-level :warning)

      #+END_SRC

** Vanilla

   Major Structures of Emacs: Files, Buffer, Windows, Frames, Input,
   International, Commands, Completions, Editing...

   Basically the 'C' (core) system and fundamental ELISP libraries.

*** X

    #+BEGIN_SRC emacs-lisp

    ;; non-nil means normalize frame before maximizing (not working)
    ;; (customize-set-variable 'x-frame-normalize-before-maximize nil)

    ;; if non-nil with a Gtk+ built Emacs, the Gtk+ tooltip is used
    (customize-set-variable 'x-gtk-use-system-tooltips t)

    ;; if this equals the symbol ’hide’, Emacs temporarily hides the child
    ;; frame during resizing (testing)
    (customize-set-variable 'x-gtk-resize-child-frames 'resize-mode)

    #+END_SRC

*** iso-transl

    Used to avoid undefined with accented characters, like tilde(~).

    #+BEGIN_SRC elisp
    (require 'iso-transl)
    #+END_SRC

*** Files

    A computer file is a computer resource for recording data
    discretely in a computer storage device.

**** Files

     Defines most of Emacs's file- and directory-handling functions,
     including basic file visiting, backup generation, link handling,
     ITS-id version control, load- and write-hook handling, and the like.

***** Require

      #+BEGIN_SRC emacs-lisp

      ;; (require 'files nil t)

      #+END_SRC

***** Functions

      #+BEGIN_SRC emacs-lisp

      (defun vlm-kill-emacs-query-function ()
        "Asks for Emacs kill confirmation."
        (interactive)
        (y-or-n-p "[kill-emacs]: Are you sure? "))

      #+END_SRC

***** Customize

      #+BEGIN_SRC emacs-lisp

      ;; control use of version numbers for backup files.
      (customize-set-variable 'version-control t)

      ;; non-nil means always use copying to create backup files
      (customize-set-variable 'backup-by-copying t)

      ;; number of newest versions to keep when a new numbered backup is made
      (customize-set-variable 'kept-new-versions 6)

      ;; number of oldest versions to keep when a new numbered backup is made
      (customize-set-variable 'kept-old-versions 2)

      ;; if t, delete excess backup versions silently
      (customize-set-variable 'delete-old-versions t)

      ;; non-nil means make a backup of a file the first time it is saved
      (customize-set-variable 'make-backup-files nil)

      ;; non-nil says by default do auto-saving of every file-visiting buffer
      (customize-set-variable 'auto-save-default nil)

      ;; most *NIX tools work best when files are terminated
      ;; with a newline
      (customize-set-variable 'require-final-newline t)

      ;; non-nil if Emacs should confirm killing processes on exit
      (customize-set-variable 'confirm-kill-processes nil)

      ;; functions to call with no arguments to query about killing Emacs
      (customize-set-variable 'kill-emacs-query-functions
                              `(server-kill-emacs-query-function vlm-kill-emacs-query-function))

      ;; alist of filename patterns and backup directory names
      (customize-set-variable 'backup-directory-alist '(("" . "~/.emacs.d/backup")))

      #+END_SRC

***** Hooks

      #+BEGIN_SRC emacs-lisp

      ;; create cache directory, if necessary
      ;; (add-hook 'window-setup-hook
      ;;           (lambda ()
      ;;             (mkdir (concat user-emacs-directory "cache") t)))

      #+END_SRC

**** Ffap

     Command find-file-at-point.
     With a prefix, it behaves exactly like find-file.
     Without a prefix, it first tries to guess a default file or URL
     from the text around the point.

***** Require

      #+BEGIN_SRC emacs-lisp

      ;; (require 'ffap nil t)

      #+END_SRC

***** Binds

      #+BEGIN_SRC emacs-lisp

      ;; vlm-files-map
      (define-key vlm-files-map (kbd "f") 'find-file-at-point)
      (define-key vlm-files-map (kbd "d") 'dired-at-point)
      (define-key vlm-files-map (kbd "C-d") 'ffap-list-directory)

      #+END_SRC

**** Locate

     Locate.el provides an interface to a program which searches a
     database of file names. By default, this program is the GNU locate
     command, but it could also be the BSD-style find command, or even a
     user specified command.

***** Require

      #+BEGIN_SRC emacs-lisp

      ;; (require 'locate nil t)

      #+END_SRC

***** Binds

      #+BEGIN_SRC emacs-lisp

      (define-key vlm-files-map (kbd "l") 'locate)

      #+END_SRC

**** Recentf

     The recent files list is automatically saved across Emacs
     sessions. You can customize the number of recent files displayed,
     the location of the menu and others options
     (see the source code for details).

***** Require

      #+BEGIN_SRC emacs-lisp

      ;; (require 'recentf nil t)

      #+END_SRC

***** Customize

      #+BEGIN_SRC emacs-lisp

      ;; file to save the recent list into.
      (customize-set-variable
       'recentf-save-file (concat user-emacs-directory "cache/recentf"))

      #+END_SRC

***** Binds

      #+BEGIN_SRC emacs-lisp

      ;; vlm-files-map
      (define-key vlm-files-map (kbd "r") 'recentf-open-files)
      (define-key vlm-files-map (kbd "t") 'recentf-find-file)

      #+END_SRC

***** Enable

      #+BEGIN_SRC emacs-lisp

      (add-hook 'window-setup-hook
                (lambda ()
                  (safe-funcall 'recentf-mode 1)))

      #+END_SRC

**** Diff

     This package helps you explore differences between files, using the
     UNIX command diff(1). The commands are `diff' and `diff-backup'.
     You can specify options with `diff-switches'.

***** Require

      #+BEGIN_SRC emacs-lisp

      ;; (require 'diff nil t)

      #+END_SRC

***** Customize

      #+BEGIN_SRC emacs-lisp

      ;; a string or list of strings specifying switches to be passed to diff
      (customize-set-variable 'diff-switches "-u")

      #+END_SRC

**** Ediff

     This package provides a convenient way of simultaneous browsing through
     the differences between a pair (or a triple) of files or buffers.
     The files being compared, file-A, file-B, and file-C (if applicable) are
     shown in separate windows (side by side, one above the another, or in
     separate frames), and the differences are highlighted as you step
     through them.

***** Require

      #+BEGIN_SRC emacs-lisp

      ;; (require 'ediff nil t)

      #+END_SRC

***** Customize

      #+BEGIN_SRC emacs-lisp

      ;; options to pass to `ediff-custom-diff-program'.
      (customize-set-variable 'ediff-custom-diff-options "-U3")

      ;; the function used to split the main window between buffer-A and buffer-B
      (customize-set-variable 'ediff-split-window-function 'split-window-horizontally)

      ;; function called to set up windows
      (customize-set-variable 'ediff-window-setup-function 'ediff-setup-windows-plain)

      #+END_SRC

***** Hooks

      #+BEGIN_SRC emacs-lisp

      (add-hook 'ediff-startup-hook 'ediff-toggle-wide-display)
      (add-hook 'ediff-cleanup-hook 'ediff-toggle-wide-display)
      (add-hook 'ediff-suspend-hook 'ediff-toggle-wide-display)

      #+END_SRC

**** Jka-compr

     This package implements low-level support for reading, writing,
     and loading compressed files.  It hooks into the low-level file
     I/O functions (including write-region and insert-file-contents) so
     that they automatically compress or uncompress a file if the file
     appears to need it (based on the extension of the file name).
     Packages like Rmail, VM, GNUS, and Info should be able to work
     with compressed files without modification.

***** Require

      #+BEGIN_SRC emacs-lisp

      ;; (require 'jka-compr nil t)
      ;; (require 'jka-compr-hook nil t)

      #+END_SRC

