src/init.el
(define-key ctl-x-map (kbd "f") 'vlm-files-map) ;; files
;; (define-key ctl-x-map (kbd "") 'vlm-filter-map)
(define-key ctl-x-map (kbd "p") 'vlm-pm-map) ; project
(define-key ctl-x-map (kbd "t") 'vlm-tags-map) ; tags
(define-key ctl-x-map (kbd "C-o") 'vlm-tabs-map) ; tabs
(define-key ctl-x-map (kbd "c") 'vlm-utils-map) ; commands
(define-key ctl-x-map (kbd "e") 'vlm-sc-map) ; errors
(define-key ctl-x-map (kbd "l") 'vlm-docs-map) ; library
(define-key ctl-x-map (kbd "v") 'vlm-media-map) ; video/media
(define-key ctl-x-map (kbd "<tab>") 'vlm-completion-map) ; tab (complete)

;; add vlm-theme-dir to theme load path
(add-to-list 'custom-theme-load-path
             (concat user-emacs-directory "themes"))
(load-theme 'moebius-glass t)

;; clean file-name-handler-alist
(setq file-name-handler-alist nil)

;; restore file-name-handler-alist
(add-hook 'emacs-startup-hook
          (lambda ()
            (setq file-name-handler-alist
                  saved-file-name-handler-alist)))

;; non-nil inhibits the startup screen
(customize-set-variable 'inhibit-startup-message nil)

;; non-nil inhibits the initial startup echo area message
(customize-set-variable 'inhibit-startup-echo-area-message nil)

;; major mode command symbol to use for the initial *scratch* buffer
(customize-set-variable 'initial-major-mode 'emacs-lisp-mode)

;; the full name of the user logged in
(customize-set-variable 'user-full-name (getenv "USER"))

;; email address of the current user
(customize-set-variable 'user-mail-address "menezes.n.eric@gmail.com")

;; (require 'warnings nil t)

;; minimum severity level for displaying the warning buffer
(customize-set-variable 'warning-minimum-level :error)

;; minimum severity level for logging a warning.
(customize-set-variable 'warning-minimum-log-level :warning)

;; non-nil means normalize frame before maximizing (not working)
;; (customize-set-variable 'x-frame-normalize-before-maximize nil)

;; if non-nil with a Gtk+ built Emacs, the Gtk+ tooltip is used
(customize-set-variable 'x-gtk-use-system-tooltips t)

;; if this equals the symbol ’hide’, Emacs temporarily hides the child
;; frame during resizing (testing)
(customize-set-variable 'x-gtk-resize-child-frames 'resize-mode)

;; (require 'files nil t)

(defun vlm-kill-emacs-query-function ()
  "Asks for Emacs kill confirmation."
  (interactive)
  (y-or-n-p "[kill-emacs]: Are you sure? "))

;; control use of version numbers for backup files.
(customize-set-variable 'version-control t)

;; non-nil means always use copying to create backup files
(customize-set-variable 'backup-by-copying t)

;; number of newest versions to keep when a new numbered backup is made
(customize-set-variable 'kept-new-versions 6)

;; number of oldest versions to keep when a new numbered backup is made
(customize-set-variable 'kept-old-versions 2)

;; if t, delete excess backup versions silently
(customize-set-variable 'delete-old-versions t)

;; non-nil means make a backup of a file the first time it is saved
(customize-set-variable 'make-backup-files nil)

;; non-nil says by default do auto-saving of every file-visiting buffer
(customize-set-variable 'auto-save-default nil)

;; most *NIX tools work best when files are terminated
;; with a newline
(customize-set-variable 'require-final-newline t)

;; non-nil if Emacs should confirm killing processes on exit
(customize-set-variable 'confirm-kill-processes nil)

;; functions to call with no arguments to query about killing Emacs
(customize-set-variable 'kill-emacs-query-functions
                        `(server-kill-emacs-query-function vlm-kill-emacs-query-function))

;; alist of filename patterns and backup directory names
(customize-set-variable 'backup-directory-alist '(("" . "~/.emacs.d/backup")))

;; create cache directory, if necessary
;; (add-hook 'window-setup-hook
;;           (lambda ()
;;             (mkdir (concat user-emacs-directory "cache") t)))

;; (require 'ffap nil t)

;; vlm-files-map
(define-key vlm-files-map (kbd "f") 'find-file-at-point)
(define-key vlm-files-map (kbd "d") 'dired-at-point)
(define-key vlm-files-map (kbd "C-d") 'ffap-list-directory)

;; (require 'locate nil t)

(define-key vlm-files-map (kbd "l") 'locate)

;; (require 'recentf nil t)

;; file to save the recent list into.
(customize-set-variable
 'recentf-save-file (concat user-emacs-directory "cache/recentf"))

;; vlm-files-map
(define-key vlm-files-map (kbd "r") 'recentf-open-files)
(define-key vlm-files-map (kbd "t") 'recentf-find-file)

(add-hook 'window-setup-hook
          (lambda ()
            (safe-funcall 'recentf-mode 1)))

;; (require 'diff nil t)

;; a string or list of strings specifying switches to be passed to diff
(customize-set-variable 'diff-switches "-u")

;; (require 'ediff nil t)

;; options to pass to `ediff-custom-diff-program'.
(customize-set-variable 'ediff-custom-diff-options "-U3")

;; the function used to split the main window between buffer-A and buffer-B
(customize-set-variable 'ediff-split-window-function 'split-window-horizontally)

;; function called to set up windows
(customize-set-variable 'ediff-window-setup-function 'ediff-setup-windows-plain)

(add-hook 'ediff-startup-hook 'ediff-toggle-wide-display)
(add-hook 'ediff-cleanup-hook 'ediff-toggle-wide-display)
(add-hook 'ediff-suspend-hook 'ediff-toggle-wide-display)

;; (require 'jka-compr nil t)
;; (require 'jka-compr-hook nil t)
