src/init.org
***** Customize

      #+BEGIN_SRC emacs-lisp

      ;; list of compression related suffixes to try when loading files
      (customize-set-variable 'jka-compr-load-suffixes '(".gz" ".el.gz"))

      ;; if you set this outside Custom while Auto Compression mode is
      ;; already enabled (as it is by default), you have to call
      ;; `jka-compr-update' after setting it to properly update other
      ;; variables. Setting this through Custom does that automatically.

      #+END_SRC

***** Enable

      #+BEGIN_SRC emacs-lisp

      ;; turn on the mode
      (add-hook 'window-setup-hook
                (lambda ()
                  (funcall 'auto-compression-mode 1)))

      #+END_SRC

**** Dired

      This is a major mode for file management operations.

      The most common operations performed on files or groups of files
      include creating, opening (e.g. viewing, playing, editing or
      printing), renaming, moving or copying, deleting and searching
      for files, as well as modifying file attributes, properties and
      file permissions.

***** Require

      #+BEGIN_SRC emacs-lisp

      ;; (require 'dired nil t)

      #+END_SRC

***** Customize

      #+BEGIN_SRC emacs-lisp

      ;; enable dired-find-alternate-file
      (add-hook 'window-setup-hook
                (lambda ()
                  (put 'dired-find-alternate-file 'disabled nil)))

      #+END_SRC

***** Binds

      #+BEGIN_SRC emacs-lisp

      ;; dired-mode-map
      (eval-after-load 'dired
        (lambda ()
          (when (boundp 'dired-mode-map)
            (define-key dired-mode-map (kbd "c") 'dired-do-copy)
            (define-key dired-mode-map (kbd "e") 'dired-create-empty-file)
            (define-key dired-mode-map (kbd "C") 'dired-do-compress-to)
            ;; redundancy
            (define-key dired-mode-map (kbd "RET") 'dired-find-alternate-file)
            (define-key dired-mode-map (kbd "C-j") 'dired-find-alternate-file))))

      ;; ctl-x-map (redundancy)
      (define-key ctl-x-map (kbd "d") 'dired)
      (define-key ctl-x-map (kbd "C-d") 'dired)

      #+END_SRC

*** Frames

    When Emacs is started on a graphical display, e.g., on the X Window
    System, it occupies a graphical system-level display region.  In this
    manual, we call this a “frame”, reserving the word “window” for the part
    of the frame used for displaying a buffer.

    - A frame initially contains one window, but it can be subdivided
      into multiple windows

    Configure/customize frame related options:

**** Require

     #+BEGIN_SRC emacs-lisp

     ;; (require 'frame nil t)

     #+END_SRC

**** Customize

     #+BEGIN_SRC emacs-lisp

     ;; with some window managers you may have to set this to non-nil
     ;; in order to set the size of a frame in pixels, to maximize
     ;; frames or to make them fullscreen.
     (customize-set-variable 'frame-resize-pixelwise t)

     ;; normalize before maximize
     (customize-set-variable 'x-frame-normalize-before-maximize t)

     ;; set frame title format
     (customize-set-variable 'frame-title-format
                             '((:eval (if (buffer-file-name)
                                          (abbreviate-file-name (buffer-file-name))
                                        "%b"))))

     ;; alist of parameters for the initial minibuffer frame.
     ;; (customize-set-variable 'minibuffer-frame-alist
     ;;                         '((top . 1)
     ;;                           (left . 1)
     ;;                           (width . 80)
     ;;                           (height . 2)))

     ;; alist of parameters for the initial X window frame
     (add-to-list 'initial-frame-alist '(fullscreen . fullheight))

     ;; alist of default values for frame creation
     (add-to-list 'default-frame-alist '(internal-border-width . 2))

     #+END_SRC

**** Hooks

     #+BEGIN_SRC emacs-lisp

     ;; set transparency after a frame is created
     ;; (add-hook 'after-make-frame-functions
     ;;           (lambda (frame)
     ;;             (set-frame-transparency .8)))

     #+END_SRC

**** Binds

     #+BEGIN_SRC emacs-lisp

     ;; global map
     ;;(global-set-key (kbd "C-x C-o") 'other-frame)

     #+END_SRC

**** Macros

     #+BEGIN_SRC emacs-lisp

     (defmacro safe-set-frame-font (font)
       "Set the default font to FONT."
       `(cond ((find-font (font-spec :name ,font))
               (set-frame-font ,font nil t))))

     ;; (safe-set-frame-font "Iosevka:pixelsize=20:width=regular:weight=regular")

     #+END_SRC

**** Enable

     #+BEGIN_SRC emacs-lisp

     ;; window divider
     (add-hook 'window-setup-hook
               (lambda ()
                 (funcall 'window-divider-mode 1)))

     ;; blink cursor
     (add-hook 'window-setup-hook
               (lambda ()
                 (funcall 'blink-cursor-mode 1)))

     #+END_SRC

*** Windows
**** Window

     Emacs windows system.

     Characteristics:

     - Each Emacs window displays one Emacs buffer at any time.
     - A single buffer may appear in more than one window.
     - Emacs can split a frame into two or many windows.
     - Multiple frames always imply multiple windows, because each
       frame has its own set of windows.
     - Each window belongs to one and only one frame.

     Configure/customize windows standard/basic options,
     the description of each one can be found on the
     commentaries.

***** Customize

      #+BEGIN_SRC emacs-lisp

      ;; number of lines of margin at the top and bottom of a window
      (customize-set-variable 'scroll-margin 0)

      ;; scroll up to this many lines, to bring point back on screen
      (customize-set-variable 'scroll-conservatively 1)

      ;; t means point keeps its screen position
      (customize-set-variable 'scroll-preserve-screen-position t)

      ;; non-nil means mouse commands use dialog boxes to ask questions
      (customize-set-variable 'use-dialog-box nil)

      ;; width in columns of left marginal area for display of a buffer
      (customize-set-variable 'left-margin-width 1)

      ;; width in columns of right marginal area for display of a buffer.
      (customize-set-variable 'right-margin-width 1)

      ;; if t, resize window combinations proportionally
      (customize-set-variable 'window-combination-resize t)

      ;; if non-nil ‘display-buffer’ will try to even window sizes
      (customize-set-variable 'even-window-sizes t)

      ;; if non-nil, left and right side windows occupy full frame height
      (customize-set-variable 'window-sides-vertical nil)

      ;; non-nil value means always make a separate frame
      (customize-set-variable 'pop-up-frames nil)

      #+END_SRC

***** Binds

      #+BEGIN_SRC emacs-lisp

      ;; binds (global)
      (global-set-key (kbd "s-l") 'shrink-window-horizontally)
      (global-set-key (kbd "s-h") 'enlarge-window-horizontally)
      (global-set-key (kbd "s-j") 'shrink-window)
      (global-set-key (kbd "s-k") 'enlarge-window)

      ;; next and previous buffer (on current window)
      (define-key ctl-x-map (kbd "C-,") 'previous-buffer)
      (define-key ctl-x-map (kbd "C-.") 'next-buffer)

      ;; binds (vlm-window prefix map)
      (define-key vlm-window-map (kbd "+") 'maximize-window)
      (define-key vlm-window-map (kbd "-") 'minimize-window)
      (define-key vlm-window-map (kbd "w") 'balance-windows)
      (define-key vlm-window-map (kbd "o") 'other-window-prefix)

      ;; binds ctl-x-map (C-x w)
      (define-key ctl-x-map (kbd "w") 'vlm-window-map)

      ;; switch to buffer
      (define-key ctl-x-map (kbd "C-b") 'switch-to-buffer)

      ;; kill buffer and window
      (define-key ctl-x-map (kbd "C-k") 'kill-buffer-and-window)

      ;; other window (redundancy)
      ;;(define-key ctl-x-map (kbd "C-o") 'other-window)

      ;; switch to the last buffer in the buffer list
      (define-key ctl-x-map (kbd "C-u") 'unbury-buffer)

      #+END_SRC

***** Display

      In its most simplistic form, a frame accommodates always
      one single window that can be used for displaying a buffer.
      As a consequence, it is always the latest call of display-buffer
      that will have succeeded in placing its buffer there.

      #+BEGIN_SRC emacs-lisp

      #+END_SRC

**** Windmove

     This package defines a set of routines, windmove-{left,up,right,
     down}, for selection of windows in a frame geometrically.
     For example, `windmove-right' selects the window immediately to the
     right of the currently-selected one.

***** Require

      #+BEGIN_SRC emacs-lisp

      ;; (require 'windmove nil t)

      #+END_SRC

***** Enable

      #+BEGIN_SRC emacs-lisp

      ;; window move default keybinds (shift-up/down etc..)
      (add-hook 'window-setup-hook
                (lambda ()
                  (funcall 'windmove-default-keybindings)))

      #+END_SRC

**** Page

     This package provides the page-oriented movement and
     selection commands documented in the Emacs manual.

***** Require

      #+BEGIN_SRC emacs-lisp

      ;; (require 'page nil t)

      #+END_SRC

***** Enable

      #+BEGIN_SRC emacs-lisp

      ;; enable narrow functions
      (add-hook 'window-setup-hook
                (lambda ()
                  (put 'narrow-to-page 'disabled nil)
                  (put 'narrow-to-region 'disabled nil)))

      #+END_SRC

*** Buffers
