src/init.org
**** Customize

     #+BEGIN_SRC emacs-lisp

     ;; non-nil means do not display continuation lines
     (customize-set-variable 'truncate-lines nil)

     ;; column beyond which automatic line-wrapping should happen
     (customize-set-variable 'fill-column 80)

     ;; sentences should be separated by a single space
     (customize-set-variable 'sentence-end-double-space nil)

     ;; list of functions called with no args to query before killing a buffer
     (customize-set-variable 'kill-buffer-query-functions nil)

     ;; non-nil means load prefers the newest version of a file
     (customize-set-variable 'load-prefer-newer t)

     ;; enable erase-buffer
     (add-hook 'window-setup-hook
               (lambda ()
                 (put 'erase-buffer 'disabled nil)))

     #+END_SRC

**** Display
***** Hl-line

      Provides a local minor mode (toggled by M-x hl-line-mode) and
      a global minor mode (toggled by M-x global-hl-line-mode) to
      highlight, on a suitable terminal, the line on which point is.

****** Require

       #+BEGIN_SRC emacs-lisp

       ;; (require 'hl-line nil t)

       #+END_SRC

****** Enable

       #+BEGIN_SRC emacs-lisp

       ;; enable highlight line
       (add-hook 'window-setup-hook
                 (lambda ()
                   (funcall 'global-hl-line-mode 1)))

       #+END_SRC

***** Linum

      Display line numbers format to be display in the current buffer.

****** Require

       #+BEGIN_SRC emacs-lisp

       ;; (require 'linum nil t)

       #+END_SRC

****** Customize

       #+BEGIN_SRC emacs-lisp

       ;; format used to display line numbers
       (customize-set-variable 'linum-format " %2d ")

       #+END_SRC

****** Hook

       #+BEGIN_SRC emacs-lisp

       ;; (add-hook 'prog-mode-hook 'linum-mode)

       #+END_SRC

***** Display-linum

      Display line numbers in the buffer.
      Provides a minor mode interface for `display-line-numbers'.

****** Require

       #+BEGIN_SRC emacs-lisp

       ;; (require 'display-line-numbers nil t)

       #+END_SRC

****** Customize

       #+BEGIN_SRC emacs-lisp

       ;; if non-nil, do not shrink line number width
       (customize-set-variable 'display-line-numbers-grow-only t)

       ;; if non-nil, count number of lines to use for line number width
       (customize-set-variable 'display-line-numbers-width-start t)

       ;; if an integer N > 0, highlight line number of every Nth line
       (customize-set-variable 'display-line-numbers-major-tick 0)

       ;; if an integer N > 0, highlight line number of every Nth line
       (customize-set-variable 'display-line-numbers-minor-tick 0)

       #+END_SRC

****** Hooks

       #+BEGIN_SRC emacs-lisp

       (add-hook 'prog-mode-hook 'display-line-numbers-mode)

       #+END_SRC

****** Enable

       #+BEGIN_SRC emacs-lisp

       ;; (safe-funcall 'global-display-line-numbers-mode 1)

       #+END_SRC

***** Display-column-indicator

      This library provides the display of the column indicator.

****** Require
****** Customize
****** Hooks

       #+BEGIN_SRC emacs-lisp

       (add-hook 'prog-mode-hook
                 (lambda ()
                   (display-fill-column-indicator-mode 1)))

       #+END_SRC

****** Binds
***** Cursor

      On a text terminal, the cursor's appearance is controlled by the
      terminal, largely out of the control of Emacs.
      Some terminals offer two different cursors: a visible static
      cursor, and a very visible blinking cursor.
      By default, Emacs uses the very visible cursor, and switches
      to it when you start or resume Emacs. If the variable
      visible-cursor is nil when Emacs starts or resumes, it uses
      the normal cursor.

****** Customize

       #+BEGIN_SRC emacs-lisp

       ;; non-nil means to make the cursor very visible
       (customize-set-variable 'visible-cursor t)

       #+END_SRC

*** Conding-System

    Emacs supports a wide variety of international character sets, including
    European and Vietnamese variants of the Latin alphabet, as well as
    Arabic scripts, Brahmic scripts (for languages such as Bengali, Hindi,
    and Thai), Cyrillic, Ethiopic, Georgian, Greek, Han (for Chinese and
    Japanese), Hangul (for Korean), Hebrew and IPA.  Emacs also supports
    various encodings of these characters that are used by other
    internationalized software, such as word processors and mailers.

    Configure/set coding-system (UTF8), everywhere!

**** Customize

     #+BEGIN_SRC emacs-lisp

     ;; coding system to use with system messages
     (customize-set-variable 'locale-coding-system 'utf-8)

     ;; coding system to be used for encoding the buffer contents on saving
     (customize-set-variable 'buffer-file-coding-system 'utf-8)

     ;; add coding-system at the front of the priority list for automatic detection
     (prefer-coding-system 'utf-8)

     ;; set coding system (UFT8)
     (set-language-environment "UTF-8")
     (set-terminal-coding-system 'utf-8)
     (set-keyboard-coding-system 'utf-8)
     (set-selection-coding-system 'utf-8)

     #+END_SRC

*** Commands
**** History

     Commands history.

***** Require

      #+BEGIN_SRC emacs-lisp

      ;; (require 'chistory nil t)

      #+END_SRC

***** Customize

      #+BEGIN_SRC emacs-lisp

      ;; maximum length of history lists before truncation takes place
      (customize-set-variable 'history-length 1024)

      ;;list history of commands that used the minibuffer
      (customize-set-variable 'list-command-history-max history-length)

      #+END_SRC

**** Minibuffer

     The minibuffer is where Emacs commands read complicated arguments,
     such as file names, buffer names, Emacs command names, or Lisp
     expressions. We call it the `minibuffer' because it's a special-purpose
     buffer with a small amount of screen space. You can use the usual Emacs
     editing commands in the minibuffer to edit the argument text.

     When the minibuffer is in use, it appears in the echo area, with a
     cursor. The minibuffer starts with a `prompt', usually ending with
     a colon.

***** Require

      #+BEGIN_SRC emacs-lisp

      ;; (require 'minibuffer nil t)

      #+END_SRC

***** Customize

      #+BEGIN_SRC emacs-lisp

      ;; non-nil means to allow minibuffer commands while in the minibuffer
      (customize-set-variable 'enable-recursive-minibuffers nil)

      ;; if non-nil, `read-answer' accepts single-character answers
      (customize-set-variable 'read-answer-short t)

      ;; non-nil means completion ignores case when reading a buffer name
      (customize-set-variable 'read-buffer-completion-ignore-case t)

      ;; non-nil means when reading a file name completion ignores case
      (customize-set-variable 'read-file-name-completion-ignore-case nil)

      ;; number of completion candidates below which cycling is used
      (customize-set-variable 'completion-cycle-threshold nil)

      ;; treat the SPC or - inserted by `minibuffer-complete-word as delimiters
      (customize-set-variable 'completion-pcm-complete-word-inserts-delimiters t)

      ;; a string of characters treated as word delimiters for completion
      (customize-set-variable 'completion-pcm-word-delimiters "-_./:| ")

      ;; if non-nil, print helpful inline messages during completion
      (customize-set-variable 'completion-show-inline-help nil)

      ;; non-nil means automatically provide help for invalid completion input
      (customize-set-variable 'completion-auto-help t)

      ;; non-nil means don’t consider case significant in completion
      (customize-set-variable 'completion-ignore-case t)

      ;; non-nil means flex completion rejects spaces in search pattern
      (customize-set-variable 'completion-flex-nospace t)

      ;; list of completion styles to use: see `completion-styles-alist variable
      (customize-set-variable 'completion-styles '(basic
                                                   initials
                                                   partial-completion
                                                   flex))

      ;; list of category-specific user overrides for completion styles
      (customize-set-variable 'completion-category-overrides
                              '((file (flex basic initials))
                                (buffer (flex basic initials))))
      ;; (info-menu (styles basic))))

      ;; define the appearance and sorting of completions
      (customize-set-variable 'completions-format 'vertical)

      ;; how to resize mini-windows (the minibuffer and the echo area)
      (customize-set-variable 'resize-mini-windows nil)

      ;; format string used to output "default" values
      (customize-set-variable 'minibuffer-default-prompt-format " (default: %s)")

      ;; if non-nil, shorten "(default ...)" to "[...]" in minibuffer prompts
      (customize-set-variable 'minibuffer-eldef-shorten-default t)

      ;; non-nil means entering the minibuffer raises the minibuffer's frame
      (customize-set-variable 'minibuffer-auto-raise t)

      ;; non-nil means to delete duplicates in history
      (customize-set-variable 'history-delete-duplicates t)

      ;; any other value means the minibuffer will move onto another frame, but
      ;; only when the user starts using a minibuffer there
      (customize-set-variable 'minibuffer-follows-selected-frame 1)

      ;; special hook to find the completion table for the entity at point (default)
      (customize-set-variable 'completion-at-point-functions
                              `(elisp-completion-at-point
                                tags-completion-at-point-function t))

      #+END_SRC

