src/init.el

;; defer garbage collection
;; set `gc-cons-threshold' to most-positive-fixnum
;; the largest lisp integer value representation
(add-hook 'minibuffer-setup-hook
          (lambda ()
            (setq gc-cons-threshold most-positive-fixnum)))

;; reset threshold to inital value (16 megabytes)
(add-hook 'minibuffer-exit-hook
          (lambda () (run-at-time 1 nil
                                  (lambda ()
                                    (setq gc-cons-threshold 16777216)))))

;; minibuffer-local-map
(define-key minibuffer-local-map (kbd "M-`") 'minibuffer-completion-help)
(define-key minibuffer-local-map (kbd "M-w") 'minibuffer-complete-word)
(define-key minibuffer-local-map (kbd "<tab>") 'minibuffer-complete)

;; global
(global-set-key (kbd "<C-delete>") 'quit-minibuffer)

;; if `file-name-shadow-mode' is active, any part of the
;; minibuffer text that would be ignored because of this is given the
;; properties in `file-name-shadow-properties', which may
;; be used to make the ignored text invisible, dim, etc.
(add-hook 'window-setup-hook
          (lambda()
            (funcall 'file-name-shadow-mode 0)))

;; when active, any recursive use of the minibuffer will show
;; the recursion depth in the minibuffer prompt, this is only
;; useful if `enable-recursive-minibuffers' is non-nil
(add-hook 'window-setup-hook
          (lambda()
            (funcall 'minibuffer-depth-indicate-mode 0)))

;; when active, minibuffer prompts that show a default value only show
;; the default when it's applicable
(add-hook 'window-setup-hook
          (lambda()
            (funcall 'minibuffer-electric-default-mode 1)))

;; (require 'savehist nil t)

;; file name where minibuffer history is saved to and loaded from.
(customize-set-variable
 'savehist-file (concat user-emacs-directory "cache/history"))

;; if non-nil, save all recorded minibuffer histories.
(customize-set-variable 'savehist-save-minibuffer-history t)

;; enable savehist mode
(add-hook 'window-setup-hook
          (lambda ()
            (funcall 'savehist-mode 1)))

;; (require 'completion nil t)

;; custom
;; how far to search in the buffer when looking for completions,
;; if nil, search the whole buffer
(customize-set-variable 'completion-search-distance 12000)

;; if non-nil, the next completion prompt does a cdabbrev search
(customize-set-variable 'completion-cdabbrev-prompt-flag nil)

;; non-nil means show help message in *Completions* buffer
(customize-set-variable 'completion-show-help nil)

;; minimum output speed at which to display next potential completion
(customize-set-variable 'completion-prompt-speed-threshold 2400)

;; non-nil means separator characters mark previous word as used
(customize-set-variable 'completion-on-separator-character t)

;; the filename to save completions to.
(customize-set-variable
 'save-completions-file-name
 (expand-file-name "cache/completitions" user-emacs-directory))

;; non-nil means save most-used completions when exiting emacs
(customize-set-variable 'save-completions-flag t)

;; discard a completion if unused for this many hours.
;; (1 day = 24, 1 week = 168)
;; if this is 0, non-permanent completions
;; will not be saved unless these are used
(customize-set-variable 'save-completions-retention-time 168)

(add-to-list 'display-buffer-alist
             '("\\*completions\\*"
               (display-buffer-below-selected display-buffer-at-bottom)
               (window-height . fit-window-to-buffer)))

;; completion-list-mode-map
(define-key completion-list-mode-map (kbd "q") 'delete-completion-window)
(define-key completion-list-mode-map (kbd "d") 'delete-completion-line)
(define-key completion-list-mode-map (kbd "w") 'kill-ring-save)
(define-key completion-list-mode-map (kbd "RET") 'choose-completion)
(define-key completion-list-mode-map (kbd "TAB") 'next-completion)
(define-key completion-list-mode-map (kbd "DEL") 'previous-completion)
(define-key completion-list-mode-map (kbd "C-j") 'choose-completion)
(define-key completion-list-mode-map (kbd "C-g") 'quit-minibuffer)

;; enable dynamic completion mode
(add-hook 'window-setup-hook
          (lambda ()
            (funcall 'dynamic-completion-mode 1)))

;; (require 'icomplete nil t)

;; custom
;; pending-completions number over which to apply `icomplete-compute-delay
(customize-set-variable 'icomplete-delay-completions-threshold 512)

;; maximum number of initial chars to apply `icomplete-compute-delay
(customize-set-variable 'icomplete-max-delay-chars 2)

;; completions-computation stall, used only with large-number completions
(customize-set-variable 'icomplete-compute-delay 0)

;; when non-nil, show completions when first prompting for input
(customize-set-variable 'icomplete-show-matches-on-no-input t)

;; if non-nil, automatically delete superfluous parts of file names
(customize-set-variable 'icomplete-tidy-shadowed-file-names t)

;; when non-nil, hide common prefix from completion candidates
(customize-set-variable 'icomplete-hide-common-prefix nil)

;; maximum number of lines to use in the minibuffer
(customize-set-variable 'icomplete-prospects-height 1)

;; string used by Icomplete to separate alternatives in the minibuffer
;; (customize-set-variable 'icomplete-separator (propertize " • " 'face 'shadow))
;; (customize-set-variable 'icomplete-separator (propertize " · " 'face 'shadow))
(customize-set-variable 'icomplete-separator (propertize " | " 'face 'shadow))

;; specialized completion tables with which `icomplete' should operate,
;; if this is t, `icomplete operates on all tables
(customize-set-variable 'icomplete-with-completion-tables t)

;; if non-nil, also use icomplete when completing in non-mini buffers
(customize-set-variable 'icomplete-in-buffer nil)
