src/init.org
***** Binds

      #+BEGIN_SRC emacs-lisp

      (eval-after-load 'icomplete
        (lambda ()
          (when (boundp 'icomplete-minibuffer-map)
            ;; unbind
            (define-key icomplete-minibuffer-map (kbd "SPC") nil)
            ;; bind
            (define-key icomplete-minibuffer-map (kbd "C-j") 'icomplete-force-complete-and-exit)
            (define-key icomplete-minibuffer-map (kbd "RET") 'exit-minibuffer)
            (define-key icomplete-minibuffer-map (kbd "<tab>") 'minibuffer-complete)
            (define-key icomplete-minibuffer-map (kbd "C-n") 'icomplete-forward-completions)
            (define-key icomplete-minibuffer-map (kbd "C-p") 'icomplete-backward-completions)
            (define-key icomplete-minibuffer-map (kbd "DEL") 'icomplete-fido-backward-updir)
            (define-key icomplete-minibuffer-map (kbd "M-p") 'previous-line-or-history-element)
            (define-key icomplete-minibuffer-map (kbd "M-n") 'next-line-or-history-element)
            (define-key icomplete-minibuffer-map (kbd "M-i") 'minibuffer-insert-completion-in-buffer)
            (define-key icomplete-minibuffer-map (kbd "M-y") 'minibuffer-insert-completion-at-point)
            (define-key icomplete-minibuffer-map (kbd "M-k") 'minibuffer-kill-current-completion)
            (define-key icomplete-minibuffer-map (kbd "M-h") 'minibuffer-describe-current-completion))))

      #+END_SRC

***** Enable

      #+BEGIN_SRC emacs-lisp

      ;; enable globally
      (add-hook 'window-setup-hook
                (lambda ()
                  (funcall 'icomplete-mode 1)))

      #+END_SRC

*** Screen

    On a graphical display, such as on GNU/Linux using the X Window System,
    Emacs occupies a graphical window.  On a text terminal, Emacs occupies
    the entire terminal screen. We will use the term `frame' to mean a
    graphical window or terminal screen occupied by Emacs. Emacs behaves
    very similarly on both kinds of frames. It normally starts out with
    just one frame, but you can create additional frames if you wish.

**** Tab-bar

     Provides `tab-bar-mode' to control display of the tab bar and
     bindings for the global tab bar.

***** Require

      #+BEGIN_SRC emacs-lisp

      ;; (require 'tab-bar nil t)

      #+END_SRC

***** Customize

      #+BEGIN_SRC emacs-lisp

      ;; defines where to show the close tab button
      (customize-set-variable 'tab-bar-close-button-show nil)

      ;; if non-nil, show the "New tab" button in the tab bar
      (customize-set-variable 'tab-bar-new-button-show nil)

      ;; string that delimits tabs
      (customize-set-variable 'tab-bar-separator " ")

      ;; if the value is ‘1’, then hide the tab bar when it has only one tab-bar-show
      ;; if t, enable `tab-bar-mode' automatically on using the commands that
      ;; create new window configurations
      (customize-set-variable 'tab-bar-show nil)

      ;; if 'rightmost', create as the last tab
      (customize-set-variable 'tab-bar-new-tab-to "rightmost")

      ;; if 'recent', select the most recently visited tab
      (customize-set-variable 'tab-bar-close-tab-select "recent")

      ;; list of modifier keys for selecting a tab by its index digit (testing)
      ;; (customize-set-variable 'tab-bar-select-tab-modifiers '("super"))

      ;; show absolute numbers on tabs in the tab bar before the tab name
      ;; (customize-set-variable 'tab-bar-tab-hints nil)

      #+END_SRC

***** Binds

      #+BEGIN_SRC emacs-lisp

      (define-key vlm-tabs-map (kbd "t") 'tab-switcher)
      (define-key vlm-tabs-map (kbd "n") 'tab-bar-new-tab)
      (define-key vlm-tabs-map (kbd "r") 'tab-bar-rename-tab)

      #+END_SRC

***** Hooks

      #+BEGIN_SRC emacs-lisp

      (add-hook 'window-setup-hook
                (lambda ()
                  (funcall 'tab-bar-mode 1)))

      #+END_SRC

**** Tool-bar

     Provides `tool-bar-mode' to control display of the tool-bar and
     bindings for the global tool bar with convenience functions
     `tool-bar-add-item' and `tool-bar-add-item-from-menu'.

     Tool bar in all graphical frames disabled by default.

***** Require

      #+BEGIN_SRC emacs-lisp

      ;; (require 'tool-bar nil t)

      #+END_SRC

***** Enable

      #+BEGIN_SRC emacs-lisp

      (add-hook 'window-setup-hook
                (lambda ()
                  (safe-funcall 'tool-bar-mode 0)))

      #+END_SRC

**** Tooltip

     When this global minor mode is enabled, Emacs displays help
     text (e.g. for buttons and menu items that you put the mouse on)
     in a pop-up window.

***** Require

      #+BEGIN_SRC emacs-lisp

      ;; (require 'tooltip nil t)

      #+END_SRC

***** Customize

      #+BEGIN_SRC emacs-lisp

      ;; seconds to wait before displaying a tooltip the first time.
      (customize-set-variable 'tooltip-delay 0.2)

      ;; use the echo area instead of tooltip frames for help and GUD tooltips
      (customize-set-variable 'tooltip-use-echo-area t)

      #+END_SRC

**** Menu-bar

     Each Emacs frame normally has a "menu bar" at the top which you can use
     to perform common operations. There's no need to list them here, as you
     can more easily see them yourself.

     Disabled by default.

***** Require

      #+BEGIN_SRC emacs-lisp

      ;; (require 'menu-bar nil t)

      #+END_SRC

***** Customize

      #+BEGIN_SRC emacs-lisp :tangle yes

      #+END_SRC

***** Binds

      #+BEGIN_SRC emacs-lisp

      (define-key vlm-utils-map (kbd "o") 'menu-bar-open)

      #+END_SRC

***** Disable

      #+BEGIN_SRC emacs-lisp

      (add-hook 'window-setup-hook
                (lambda ()
                  (safe-funcall 'menu-bar-mode 0)))

      #+END_SRC

**** Scroll-bar

     Specify whether to have vertical scroll bars, and on which side.
     Disabled by default.

***** Require

      #+BEGIN_SRC emacs-lisp

      ;; (require 'scroll-bar nil t)

      #+END_SRC

***** Disable

      #+BEGIN_SRC emacs-lisp

      ;; disable scroll bar
      (add-hook 'window-setup-hook
                (lambda ()
                  (safe-funcall 'scroll-bar-mode 0)))

      #+END_SRC

**** Fringe

     Contains code to initialize the built-in fringe bitmaps
     as well as helpful functions for customizing the appearance of the
     fringe.

***** Require

      #+BEGIN_SRC emacs-lisp

      ;; (require 'fringe nil t)

      #+END_SRC

***** Customize

      #+BEGIN_SRC emacs-lisp

      ;; custom
      ;; 0 -> ("no-fringes" . 0), remove ugly icons to represet new lines
      ;; ascii is more than enough to represent this information
      ;; default appearance of fringes on all frame
      (customize-set-variable 'fringe-mode 0)

      #+END_SRC

**** Mode-line

     Each Emacs window (aside from minibuffer windows) typically has a mode
     line at the bottom, which displays status information about the buffer
     displayed in the window. The mode line contains information about the
     buffer, such as its name, associated file, depth of recursive editing,
     and major and minor modes.

***** Customize

      #+BEGIN_SRC emacs-lisp

    ;; remove underline
    (customize-set-variable 'x-underline-at-descent-line t)

    ;; mode-line format
    (customize-set-variable 'mode-line-format
                '(" "
                  "λ"
                  " "
                  "»"
                  " "
                  (:eval (format-time-string " %H:%M"))
                  " "
                  "¦"
                  ;; "
                  ;; mode-line-front-space
                  " "
                  mode-line-modified
                  mode-line-remote
                  ;; (:eval (when (display-graphic-p)
                  ;;          (format "  %d/%d"
                  ;;                  exwm-workspace-current-index
                  ;;                  (exwm-workspace--count))))
                  " "
                  "¦"
                  " "
                  "%l'%c"
                  " "
                  "·"
                  " "
                  (:eval (propertized-buffer-identification "(%b)"))
                  " "
                  "·"
                  " "
                  "("
                  (:eval (upcase (replace-regexp-in-string "-mode" "" (symbol-name major-mode))))
                  ")"
                  (:eval (when vc-mode (concat " » " (projectile-project-name) " »")))
                  (vc-mode vc-mode)))

      #+END_SRC

**** Wallpaper

     Set default wallpaper (uses vex-util package!).

***** Hooks

      #+BEGIN_SRC emacs-lisp

      ;; set wallpaper
      ;; (add-hook 'window-setup-hook
      ;;           (lambda()
      ;;             (set-wallpaper
      ;;              "~/media/images/wallpapers/studio-ghibli/ghibli-7.jpg"
      ;;              "-g -0-0")))

      #+END_SRC

*** Bell

    Force visible-bell to nill, avoiding anoiyng sounds. And sets
    ring-bell-function to a lambda that inverts the face of modeline.

    #+BEGIN_SRC emacs-lisp
    (setq visible-bell nil
          ring-bell-function '(lambda ()
                                (invert-face 'mode-line)
                                (run-with-timer 0.01 nil #'invert-face 'mode-line)))
    #+END_SRC

*** Editing
**** Basic Edition commands
***** Binds

    Functions from LEX that is needed to reimplement.

      #+BEGIN_SRC

        ;; edit
        ;; (global-set-key (kbd "M-y") 'browse-kill-ring)         ;;
        ;; (global-set-key (kbd "M-i") 'indent-region-or-buffer)      ;;
        ;; (global-set-key (kbd "M-j") 'duplicate-line-or-region)     ;;
        ;; (global-set-key (kbd "M-n") 'transpose-lines-up)       ;;
        ;; (global-set-key (kbd "M-p") 'transpose-lines-down)         ;;
        ;; (global-set-key (kbd "M-l") 'downcase-word)            ;;
        ;; (global-set-key (kbd "C-w") 'kill-region-or-backward-word) ;;
        ;;                                ;;

      #+END_SRC

**** Mark
***** Binds

      #+BEGIN_SRC
        ;; shell command history
        (define-key ctl-x-map (kbd "C-x") 'shell-command)
        ;;(define-key ctl-x-map (kbd "C-c") 'eval-command-history)

        ;; mark
        (define-key vlm-utils-map (kbd "h") 'mark-whole-buffer)
        (define-key vlm-utils-map (kbd "s") 'mark-sexp)
        (define-key vlm-utils-map (kbd "p") 'mark-paragraph)
        (define-key vlm-utils-map (kbd "w") 'mark-word)

      #+END_SRC

**** Indent

     Commands for making and changing indentation in text.
     These are described in the Emacs manual.

