src/init.el

(eval-after-load 'icomplete
  (lambda ()
    (when (boundp 'icomplete-minibuffer-map)
      ;; unbind
      (define-key icomplete-minibuffer-map (kbd "SPC") nil)
      ;; bind
      (define-key icomplete-minibuffer-map (kbd "C-j") 'icomplete-force-complete-and-exit)
      (define-key icomplete-minibuffer-map (kbd "RET") 'exit-minibuffer)
      (define-key icomplete-minibuffer-map (kbd "<tab>") 'minibuffer-complete)
      (define-key icomplete-minibuffer-map (kbd "C-n") 'icomplete-forward-completions)
      (define-key icomplete-minibuffer-map (kbd "C-p") 'icomplete-backward-completions)
      (define-key icomplete-minibuffer-map (kbd "DEL") 'icomplete-fido-backward-updir)
      (define-key icomplete-minibuffer-map (kbd "M-p") 'previous-line-or-history-element)
      (define-key icomplete-minibuffer-map (kbd "M-n") 'next-line-or-history-element)
      (define-key icomplete-minibuffer-map (kbd "M-i") 'minibuffer-insert-completion-in-buffer)
      (define-key icomplete-minibuffer-map (kbd "M-y") 'minibuffer-insert-completion-at-point)
      (define-key icomplete-minibuffer-map (kbd "M-k") 'minibuffer-kill-current-completion)
      (define-key icomplete-minibuffer-map (kbd "M-h") 'minibuffer-describe-current-completion))))

;; enable globally
(add-hook 'window-setup-hook
          (lambda ()
            (funcall 'icomplete-mode 1)))

;; (require 'tab-bar nil t)

;; defines where to show the close tab button
(customize-set-variable 'tab-bar-close-button-show nil)

;; if non-nil, show the "New tab" button in the tab bar
(customize-set-variable 'tab-bar-new-button-show nil)

;; string that delimits tabs
(customize-set-variable 'tab-bar-separator " ")

;; if the value is ‘1’, then hide the tab bar when it has only one tab-bar-show
;; if t, enable `tab-bar-mode' automatically on using the commands that
;; create new window configurations
(customize-set-variable 'tab-bar-show nil)

;; if 'rightmost', create as the last tab
(customize-set-variable 'tab-bar-new-tab-to "rightmost")

;; if 'recent', select the most recently visited tab
(customize-set-variable 'tab-bar-close-tab-select "recent")

;; list of modifier keys for selecting a tab by its index digit (testing)
;; (customize-set-variable 'tab-bar-select-tab-modifiers '("super"))

;; show absolute numbers on tabs in the tab bar before the tab name
;; (customize-set-variable 'tab-bar-tab-hints nil)

(define-key vlm-tabs-map (kbd "t") 'tab-switcher)
(define-key vlm-tabs-map (kbd "n") 'tab-bar-new-tab)
(define-key vlm-tabs-map (kbd "r") 'tab-bar-rename-tab)

(add-hook 'window-setup-hook
          (lambda ()
            (funcall 'tab-bar-mode 1)))

;; (require 'tool-bar nil t)

(add-hook 'window-setup-hook
          (lambda ()
            (safe-funcall 'tool-bar-mode 0)))

;; (require 'tooltip nil t)

;; seconds to wait before displaying a tooltip the first time.
(customize-set-variable 'tooltip-delay 0.2)

;; use the echo area instead of tooltip frames for help and GUD tooltips
(customize-set-variable 'tooltip-use-echo-area t)

;; (require 'menu-bar nil t)



(define-key vlm-utils-map (kbd "o") 'menu-bar-open)

(add-hook 'window-setup-hook
          (lambda ()
            (safe-funcall 'menu-bar-mode 0)))

;; (require 'scroll-bar nil t)

;; disable scroll bar
(add-hook 'window-setup-hook
          (lambda ()
            (safe-funcall 'scroll-bar-mode 0)))

;; (require 'fringe nil t)

;; custom
;; 0 -> ("no-fringes" . 0), remove ugly icons to represet new lines
;; ascii is more than enough to represent this information
;; default appearance of fringes on all frame
(customize-set-variable 'fringe-mode 0)

;; remove underline
(customize-set-variable 'x-underline-at-descent-line t)

;; mode-line format
(customize-set-variable 'mode-line-format
            '(" "
              "λ"
              " "
              "»"
              " "
              (:eval (format-time-string " %H:%M"))
              " "
              "¦"
              ;; "
              ;; mode-line-front-space
              " "
              mode-line-modified
              mode-line-remote
              ;; (:eval (when (display-graphic-p)
              ;;          (format "  %d/%d"
              ;;                  exwm-workspace-current-index
              ;;                  (exwm-workspace--count))))
              " "
              "¦"
              " "
              "%l'%c"
              " "
              "·"
              " "
              (:eval (propertized-buffer-identification "(%b)"))
              " "
              "·"
              " "
              "("
              (:eval (upcase (replace-regexp-in-string "-mode" "" (symbol-name major-mode))))
              ")"
              (:eval (when vc-mode (concat " » " (projectile-project-name) " »")))
              (vc-mode vc-mode)))

;; set wallpaper
;; (add-hook 'window-setup-hook
;;           (lambda()
;;             (set-wallpaper
;;              "~/media/images/wallpapers/studio-ghibli/ghibli-7.jpg"
;;              "-g -0-0")))

(setq visible-bell nil
      ring-bell-function '(lambda ()
                            (invert-face 'mode-line)
                            (run-with-timer 0.01 nil #'invert-face 'mode-line)))
