src/init.org
***** Customize

      #+BEGIN_SRC emacs-lisp

      ;; indentation can insert tabs if this is non-nil
      (customize-set-variable 'indent-tabs-mode nil)

      ;; default number of columns for margin-changing functions to indent
      (customize-set-variable 'standard-indent 4)

      ;; distance between tab stops (for display of tab characters), in columns.
      (customize-set-variable 'tab-width 4)

      ;; if 'complete, TAB first tries to indent the current line
      ;; if t, hitting TAB always just indents the current line
      ;; If nil, hitting TAB indents the current line if point is at the left margin
      ;; or in the line's indentation
      (customize-set-variable 'tab-always-indent 'complete)

      #+END_SRC

**** Kmacro

     The kmacro package provides the user interface to emacs' basic
     keyboard macro functionality.  With kmacro, two function keys are
     dedicated to keyboard macros, by default F3 and F4.

***** Require

      #+BEGIN_SRC emacs-lisp

      ;; (require 'kmacro nil t)

      #+END_SRC

***** Binds

      #+BEGIN_SRC emacs-lisp

      (define-key ctl-x-map (kbd "m") 'kmacro-keymap)

      #+END_SRC

**** Elec-pair

     Electric pairing: automatically matches parenthesis pairs,
     should be enabled regardless the current major mode.

***** Require

      #+BEGIN_SRC emacs-lisp

      ;; (require 'elec-pair nil t)

      #+END_SRC

***** Customize

      #+BEGIN_SRC emacs-lisp

      ;; alist of pairs that should be used regardless of major mode.
      (customize-set-variable 'electric-pair-pairs
                              '((?\{ . ?\})
                                (?\( . ?\))
                                (?\[ . ?\])
                                (?\" . ?\")))

      #+END_SRC

***** Enable

      #+BEGIN_SRC emacs-lisp

      (add-hook 'window-setup-hook
                (lambda ()
                  (funcall 'electric-pair-mode 1)))

      #+END_SRC

**** Newcomment

     This library contains functions and variables for commenting and
     uncommenting source code.

***** Require

      #+BEGIN_SRC emacs-lisp

      ;; (require 'newcomment nil t)

      #+END_SRC

***** Binds

      #+BEGIN_SRC emacs-lisp

      ;; global-map
      (global-set-key (kbd "M-c") 'comment-line)

      #+END_SRC

**** Face-remap

     This package defines some simple operations that can be used for
     maintaining the `face-remapping-alist' in a cooperative way.
     This is especially important for the `default' face.

***** Require

      #+BEGIN_SRC emacs-lisp

      ;; (require 'face-remap nil t)

      #+END_SRC

***** Binds

      #+BEGIN_SRC emacs-lisp

      ;; ctl-x-map (C-x)
      (define-key ctl-x-map (kbd "=") 'text-scale-adjust)

      #+END_SRC

**** Delsel

     This package makes the active region be pending delete, meaning that
     text inserted while the region is active will replace the region contents.
     This is a popular behavior of personal computers text editors.

***** Require

      #+BEGIN_SRC emacs-lisp

      ;; (require 'delsel nil t)

      #+END_SRC

***** Enable

      #+BEGIN_SRC emacs-lisp

      ;; delete selection-mode
      (add-hook 'window-setup-hook
                (lambda ()
                  (funcall 'delete-selection-mode 1)))

      #+END_SRC

**** Replace

     This package supplies the string and regular-expression replace functions
     documented in the Emacs user's manual.

***** Require

      #+BEGIN_SRC emacs-lisp

      ;; (require 'replace nil t)

      #+END_SRC

***** Binds

      #+BEGIN_SRC emacs-lisp

      ;;(global-set-key (kbd "M-s M-o") 'list-occurrences-at-point)

      #+END_SRC

**** Rectangle

     Rectangle: Operations on rectangles!

     This package provides the operations on rectangles that are documented
     in the Emacs manual.

***** Require

      #+BEGIN_SRC emacs-lisp

      ;; (require 'rect nil t)

      #+END_SRC

***** Binds

      #+BEGIN_SRC emacs-lisp

        ;; global map
        (global-set-key (kbd "C-x r %") 'replace-rectangle)

      #+END_SRC

**** Whitespace

     This package is a minor mode to visualize and clean
     blanks (TAB, (HARD) SPACE and NEWLINE).

***** Require

      #+BEGIN_SRC emacs-lisp

      ;; (require 'whitespace nil t)

      #+END_SRC

***** Customize

      #+BEGIN_SRC emacs-lisp

      ;; specify which kind of blank is visualized
      ;; empty was removed
      (customize-set-variable
       'whitespace-style
       '(face
         tabs spaces trailing lines
         space-before-tab newline indentation
         space-after-tab space-mark tab-mark
         newline-mark missing-newline-at-eof))

      #+END_SRC

***** Hooks

      #+BEGIN_SRC emacs-lisp

      ;; clean whitespace and newlines before buffer save
      (add-hook 'before-save-hook #'whitespace-cleanup)

      #+END_SRC

***** Binds

      #+BEGIN_SRC emacs-lisp

      ;; binds
      (define-key ctl-x-map (kbd ".") 'whitespace-mode)

      #+END_SRC

*** Help
**** Help

     GNU Emacs's built-in help system, the one invoked by
     M-x help-for-help.

***** Require

      #+BEGIN_SRC emacs-lisp

      ;; (require 'help nil t)

      #+END_SRC

**** Customize

     #+BEGIN_SRC emacs-lisp

     ;; always select the help window
     (customize-set-variable 'help-window-select nil)

     ;; maximum height of a window displaying a temporary buffer.
     (customize-set-variable 'temp-buffer-max-height
                             (lambda (buffer)
                               (if (and (display-graphic-p) (eq (selected-window) (frame-root-window)))
                                   (/ (x-display-pixel-height) (frame-char-height) 4)
                                 (/ (frame-height) 4))))

     ;; the minimum total height, in lines, of any window
     (customize-set-variable 'window-min-height 4)

     #+END_SRC

***** Display

      #+BEGIN_SRC emacs-lisp

      #+END_SRC

***** Enable

      #+BEGIN_SRC emacs-lisp

      (add-hook 'window-setup-hook
                (lambda ()
                  (funcall 'temp-buffer-resize-mode 1)))

      #+END_SRC

**** Help-fns

     This file contains those help commands which are complicated, and
     which may not be used in every session. For example
     `describe-function' will probably be heavily used when doing elisp
     programming, but not if just editing C files.

***** Require

      #+BEGIN_SRC emacs-lisp

      ;; (require 'help-fns nil t)

      #+END_SRC

**** Help-mode

     Help-mode, which is the mode used by *Help* buffers, and
     associated support machinery, such as adding hyperlinks, etc...

***** Require

      #+BEGIN_SRC emacs-lisp

      ;; (require 'help-mode nil t)

      #+END_SRC

***** Binds

      #+BEGIN_SRC emacs-lisp

      (eval-after-load 'help-mode
        (lambda ()
          (when (boundp 'help-mode-map)
            (define-key help-mode-map (kbd "C-j") 'push-button))))

      ;; help prefix map (C-h) (redundancy)
      (define-key help-map (kbd "C-f") 'describe-function)
      (define-key help-map (kbd "C-v") 'describe-variable)
      (define-key help-map (kbd "C-k") 'describe-key)
      (define-key help-map (kbd "C-m") 'describe-mode)
      (define-key help-map (kbd "C-o") 'describe-symbol)
      (define-key help-map (kbd "C-e") 'view-echo-area-messages)

      #+END_SRC

*** Docs
**** Info

     The GNU Project distributes most of its manuals in the Info format,
     which you read using an Info reader.

***** Require

      #+BEGIN_SRC emacs-lisp

      ;; (require 'info nil t)

      #+END_SRC

***** Customize

      #+BEGIN_SRC emacs-lisp

      ;; non-nil means don’t record intermediate Info nodes to the history
      (customize-set-variable 'Info-history-skip-intermediate-nodes nil)

      ;; list of additional directories to search for (not working)
      ;; (customize-set-variable 'Info-additional-directory-list
      ;;                         `(,(expand-file-name "info/" user-emacs-directory)))

      ;; list of directories to search for Info documentation files (works!)
      (customize-set-variable 'Info-directory-list
                              `("/usr/local/share/emacs/info/"
                                "/usr/local/share/info/"
                                ,(expand-file-name "info/" user-emacs-directory)))

      ;; 0 -> means do not display breadcrumbs
      (customize-set-variable 'info-breadcrumbs-depth 0)

      #+END_SRC

***** Binds

      #+BEGIN_SRC emacs-lisp

      ;; help-map
      (define-key help-map (kbd "TAB") 'info-display-manual)

      ;; info-mode-map
      (eval-after-load 'info
        (lambda ()
          (when (boundp 'Info-mode-map)
            (define-key Info-mode-map (kbd "C-j") 'Info-follow-nearest-node))))

      #+END_SRC

**** Eldoc

     As you type a function's symbol name as part of a sexp,
     it will print the argument list for that function.
     Behavior is not identical; for example, you need not actually
     type the function name, you need only move point around in a sexp that
     calls it.  Also, if point is over a documented variable, it will print
     the one-line documentation for that variable instead, to remind you of
     that variable's meaning.

***** Require

      #+BEGIN_SRC emacs-lisp

      ;; (require 'eldoc nil t)

      #+END_SRC

***** Customize

      #+BEGIN_SRC emacs-lisp

      ;; number of seconds of idle time to wait before printing.
      (customize-set-variable 'eldoc-idle-delay 0.1)

      ;; if value is any non-nil value other than t, symbol name may be truncated
      ;; if it will enable the function arglist or documentation string to fit on a
      ;; single line without resizing window
      (customize-set-variable 'eldoc-echo-area-use-multiline-p t)

      #+END_SRC

***** Enable

      #+BEGIN_SRC emacs-lisp

      ;; enable eldoc globally
      (add-hook 'window-setup-hook
                (lambda()
                  (funcall 'eldoc-mode 1)))

      #+END_SRC

*** Utils
**** Bookmark

     Bookmarks are somewhat like registers in that they record positions
     you can jump to. Unlike registers, they have long names, and they
     persist automatically from one Emacs session to the next.
     The prototypical use of bookmarks is to record where you were
     reading in various files.

     The bookmark list is sorted lexically by default, but you can turn
     this off by setting bookmark-sort-flag to nil. If it is nil, then
     the list will be presented in the order it is recorded
     (chronologically), which is actually fairly useful as well.

***** Require

      #+BEGIN_SRC emacs-lisp

      ;; (require 'bookmark nil t)

      #+END_SRC

***** Customize

      #+BEGIN_SRC emacs-lisp

      ;; custom
      ;; file in which to save bookmarks by default.
      (customize-set-variable
       'bookmark-default-file (concat user-emacs-directory "cache/bookmarks"))

      #+END_SRC

