src/init.el

;; indentation can insert tabs if this is non-nil
(customize-set-variable 'indent-tabs-mode nil)

;; default number of columns for margin-changing functions to indent
(customize-set-variable 'standard-indent 4)

;; distance between tab stops (for display of tab characters), in columns.
(customize-set-variable 'tab-width 4)

;; if 'complete, TAB first tries to indent the current line
;; if t, hitting TAB always just indents the current line
;; If nil, hitting TAB indents the current line if point is at the left margin
;; or in the line's indentation
(customize-set-variable 'tab-always-indent 'complete)

;; (require 'kmacro nil t)

(define-key ctl-x-map (kbd "m") 'kmacro-keymap)

;; (require 'elec-pair nil t)

;; alist of pairs that should be used regardless of major mode.
(customize-set-variable 'electric-pair-pairs
                        '((?\{ . ?\})
                          (?\( . ?\))
                          (?\[ . ?\])
                          (?\" . ?\")))

(add-hook 'window-setup-hook
          (lambda ()
            (funcall 'electric-pair-mode 1)))

;; (require 'newcomment nil t)

;; global-map
(global-set-key (kbd "M-c") 'comment-line)

;; (require 'face-remap nil t)

;; ctl-x-map (C-x)
(define-key ctl-x-map (kbd "=") 'text-scale-adjust)

;; (require 'delsel nil t)

;; delete selection-mode
(add-hook 'window-setup-hook
          (lambda ()
            (funcall 'delete-selection-mode 1)))

;; (require 'replace nil t)

;;(global-set-key (kbd "M-s M-o") 'list-occurrences-at-point)

;; (require 'rect nil t)

;; global map
(global-set-key (kbd "C-x r %") 'replace-rectangle)

;; (require 'whitespace nil t)

;; specify which kind of blank is visualized
;; empty was removed
(customize-set-variable
 'whitespace-style
 '(face
   tabs spaces trailing lines
   space-before-tab newline indentation
   space-after-tab space-mark tab-mark
   newline-mark missing-newline-at-eof))

;; clean whitespace and newlines before buffer save
(add-hook 'before-save-hook #'whitespace-cleanup)

;; binds
(define-key ctl-x-map (kbd ".") 'whitespace-mode)

;; (require 'help nil t)

;; always select the help window
(customize-set-variable 'help-window-select nil)

;; maximum height of a window displaying a temporary buffer.
(customize-set-variable 'temp-buffer-max-height
                        (lambda (buffer)
                          (if (and (display-graphic-p) (eq (selected-window) (frame-root-window)))
                              (/ (x-display-pixel-height) (frame-char-height) 4)
                            (/ (frame-height) 4))))

;; the minimum total height, in lines, of any window
(customize-set-variable 'window-min-height 4)



(add-hook 'window-setup-hook
          (lambda ()
            (funcall 'temp-buffer-resize-mode 1)))

;; (require 'help-fns nil t)

;; (require 'help-mode nil t)

(eval-after-load 'help-mode
  (lambda ()
    (when (boundp 'help-mode-map)
      (define-key help-mode-map (kbd "C-j") 'push-button))))

;; help prefix map (C-h) (redundancy)
(define-key help-map (kbd "C-f") 'describe-function)
(define-key help-map (kbd "C-v") 'describe-variable)
(define-key help-map (kbd "C-k") 'describe-key)
(define-key help-map (kbd "C-m") 'describe-mode)
(define-key help-map (kbd "C-o") 'describe-symbol)
(define-key help-map (kbd "C-e") 'view-echo-area-messages)

;; (require 'info nil t)

;; non-nil means don’t record intermediate Info nodes to the history
(customize-set-variable 'Info-history-skip-intermediate-nodes nil)

;; list of additional directories to search for (not working)
;; (customize-set-variable 'Info-additional-directory-list
;;                         `(,(expand-file-name "info/" user-emacs-directory)))

;; list of directories to search for Info documentation files (works!)
(customize-set-variable 'Info-directory-list
                        `("/usr/local/share/emacs/info/"
                          "/usr/local/share/info/"
                          ,(expand-file-name "info/" user-emacs-directory)))

;; 0 -> means do not display breadcrumbs
(customize-set-variable 'info-breadcrumbs-depth 0)

;; help-map
(define-key help-map (kbd "TAB") 'info-display-manual)

;; info-mode-map
(eval-after-load 'info
  (lambda ()
    (when (boundp 'Info-mode-map)
      (define-key Info-mode-map (kbd "C-j") 'Info-follow-nearest-node))))

;; (require 'eldoc nil t)

;; number of seconds of idle time to wait before printing.
(customize-set-variable 'eldoc-idle-delay 0.1)

;; if value is any non-nil value other than t, symbol name may be truncated
;; if it will enable the function arglist or documentation string to fit on a
;; single line without resizing window
(customize-set-variable 'eldoc-echo-area-use-multiline-p t)

;; enable eldoc globally
(add-hook 'window-setup-hook
          (lambda()
            (funcall 'eldoc-mode 1)))

;; (require 'bookmark nil t)

;; custom
;; file in which to save bookmarks by default.
(customize-set-variable
 'bookmark-default-file (concat user-emacs-directory "cache/bookmarks"))
