src/init.org
***** Customize

      #+BEGIN_SRC emacs-lisp

      ;; frame width to use for rendering
      (customize-set-variable 'shr-width 80)

      ;; if non-nil, use proportional fonts for text
      (customize-set-variable 'shr-use-fonts nil)

      ;; if non-nil, respect color specifications in the HTML
      (customize-set-variable 'shr-use-colors t)

      ;; if non-nil, inhibit loading images
      (customize-set-variable 'shr-inhibit-images t)

      ;; images that have URLs matching this regexp will be blocked (regexp)
      (customize-set-variable 'shr-blocked-images nil)

      #+END_SRC

*** Misc
**** Custom

     Emacs has many settings which you can change. Most settings are
     customizable variables, which are also called user options.
     There is a huge number of customizable variables,
     controlling numerous aspects of Emacs behavior.

***** Require

      #+BEGIN_SRC emacs-lisp

      ;; (require 'custom nil t)

      #+END_SRC

***** Customize

      #+BEGIN_SRC emacs-lisp

      ;; file used for storing customization information.
      ;; The default is nil, which means to use your init file
      ;; as specified by ‘user-init-file’.  If the value is not nil,
      ;; it should be an absolute file name.
      (customize-set-variable
       'custom-file (concat (expand-file-name user-emacs-directory) "custom.el"))

      #+END_SRC

*** Lazy-Load

     Automatic generate `autoload' definitions.

***** Require

      #+BEGIN_SRC emacs-lisp

      ;; (require 'lazy-load nil t)

      #+END_SRC

***** Customize

      #+BEGIN_SRC emacs-lisp

      ;; non-nil means starts to monitor the directories
      (customize-set-variable 'lazy-load-enable-filenotify-flag t)

      ;; non-nil means show debug messages
      (customize-set-variable 'lazy-load-debug-messages-flag t)

      ;; non-nil means run `lazy-load-update-autoloads' when emacs is idle
      (customize-set-variable 'lazy-load-enable-run-idle-flag nil)

      ;; idle timer value
      (customize-set-variable 'lazy-load-idle-seconds 30)

      ;; interval in seconds, used to trigger the timer callback
      (customize-set-variable 'lazy-load-timer-interval 15)

      ;; target files and directories
      (customize-set-variable 'lazy-load-files-alist
                              (list
                               ;; lisp directory
                               (cons "lisp-loaddefs.el" (expand-file-name "lisp/" user-emacs-directory))
                               ;; site-lisp directory
                               (cons "site-lisp-loaddefs.el"
                                     (expand-file-name "site-lisp/" user-emacs-directory))))

      #+END_SRC

***** Enable

      #+BEGIN_SRC emacs-lisp

        ;; (add-hook 'window-setup-hook
        ;;           (lambda ()
        ;;             (funcall 'turn-on-lazy-load-mode)))

      #+END_SRC

** Extensions

   Elisp libraries installe under ~.emacs/site-lisp~ directory. Refers to libraries
   often specialized to one topic, e.g. a programming language, an interface for a
   extenal program.

*** Loaddefs

    The local ~lisp-loaddefs.el~ was generated by
    =update-directory-autoloads=, using the ~/emacs.d/site-lisp~
    directory, where the packages were installed.

    Update/Generate =autoload= definitions for Lisp files in the directories.
    In an interactive call, you must give one argument, the name of a
    single directory. In a call from Lisp, you can supply multiple
    directories as separate arguments.

    #+BEGIN_SRC emacs-lisp

      ;; generated by `update-directory-autoloads'
      (require 'lisp-loaddefs nil t)
      (require 'site-lisp-loaddefs nil t)

    #+END_SRC

*** Windows (X)

     A window manager is system software that controls the placement
     and appearance of windows within a windowing system in a graphical
     user interface. Most window managers are designed to help provide
     a desktop environment.

     Finally an Emacs window means X11/Xorg WINDOW as well :D!
     Thanks to EXWM! (great library!).

***** Exwm

      EXWM (Emacs X Window Manager) is a full-featured tiling X window manager
      for Emacs built on top of XELB.

****** Require

       #+BEGIN_SRC emacs-lisp

       ;; (require 'exwm nil t)

       #+END_SRC

****** Defines

       #+BEGIN_SRC emacs-lisp

       (defvar eos-xrandr-right-screen "eDP1"
         "Defines the screen located at right side")

       (defvar eos-xrandr-left-screen "HDMI1"
         "Defines the screen located at right side")

       (defvar eos-xrandr-command
         (format "xrandr --output %s --right-of %s"
                 eos-xrandr-right-screen
                 eos-xrandr-left-screen)
         "Defines the screen located at right side")


       #+END_SRC

****** Customize

       #+BEGIN_SRC emacs-lisp

       ;; monitors: check the xrandr(1) output and use the same name/order
       ;; TODO: create a func that retrieves these values from xrandr

       (customize-set-variable
        'exwm-randr-workspace-monitor-plist '(0 "eDP1"
                                                1 "HDMI1"
                                                2 "HDMI1"))

       (customize-set-variable 'exwm-workspace-number
                               (if (boundp 'exwm-randr-workspace-monitor-plist)
                                   (/ (safe-length exwm-randr-workspace-monitor-plist) 2)
                                 1))

       ;; set exwm workspaces number
       (customize-set-variable 'exwm-workspace-number 2)

       ;; show workspaces in all buffers
       (customize-set-variable 'exwm-workspace-show-all-buffers nil)

       ;; non-nil to allow switching to buffers on other workspaces
       (customize-set-variable 'exwm-layout-show-all-buffers nil)

       ;; non-nil to force managing all X windows in tiling layout.
       (customize-set-variable 'exwm-manage-force-tiling t)

       ;; exwn global keybindings
       (customize-set-variable 'exwm-input-global-keys
                               `(([?\s-r] . exwm-reset)
                                 ([?\s-q] . exwm-input-toggle-keyboard)
                                 ([?\s-d] . exwm-floating-toggle-floating)
                                 ([?\s-m] . exwm-layout-toggle-fullscreen)

                                 ;; create and switch to workspaces
                                 ,@(mapcar (lambda (i)
                                             `(,(kbd (format "s-%d" i)) .
                                               (lambda ()
                                                 (interactive)
                                                 (exwm-workspace-switch-create ,i))))
                                           (number-sequence 0 2))))

       ;; The following example demonstrates how to use simulation keys to mimic
       ;; the behavior of Emacs.  The value of `exwm-input-simulation-keys` is a
       ;; list of cons cells (SRC . DEST), where SRC is the key sequence you press
       ;; and DEST is what EXWM actually sends to application.  Note that both SRC
       ;; and DEST should be key sequences (vector or string).
       (customize-set-variable 'exwm-input-simulation-keys
                               '(
                                 ;; movement
                                 ([?\C-p] . [up])
                                 ([?\C-b] . [left])
                                 ([?\C-f] . [right])
                                 ([?\C-n] . [down])
                                 ([?\M-b] . [C-left])
                                 ([?\M-f] . [C-right])
                                 ([?\C-e] . [end])
                                 ([?\C-v] . [next])
                                 ([?\C-a] . [home])
                                 ([?\M-v] . [prior])
                                 ([?\C-d] . [delete])
                                 ([?\C-k] . [S-end delete])

                                 ;; browser temporary
                                 ([?\C-o] . [C-prior]) ; change tab mapping
                                 ([?\C-k] . [C-w]) ; close tab mapping
                                 ([?\C-j] . [return]) ; close tab mapping

                                 ;; cut/paste.
                                 ([?\C-w] . [?\C-x])
                                 ([?\M-w] . [?\C-c])
                                 ([?\C-y] . [?\C-v])

                                 ;; Escape (cancel)
                                 ([?\C-g] . [escape])

                                 ;; search
                                 ([?\C-s] . [?\C-f])))

       #+END_SRC

****** Binds

       #+BEGIN_SRC emacs-lisp

       ;; this little bit will make sure that XF86 keys work in exwm buffers as well
       (if (boundp 'exwm-input-prefix-keys)
           (progn
             (dolist (key '(XF86AudioLowerVolume
                            XF86AudioRaiseVolume
                            XF86PowerOff
                            XF86AudioMute
                            XF86AudioPlay
                            XF86AudioStop
                            XF86AudioPrev
                            XF86AudioNext
                            XF86ScreenSaver
                            XF68Back
                            XF86Forward
                            Scroll_Lock
                            print))
               (cl-pushnew key exwm-input-prefix-keys))))

       #+END_SRC

