src/init.org
****** Hooks

       #+BEGIN_SRC emacs-lisp

       ;; All buffers created in EXWM mode are named "*EXWM*". You may want to
       ;; change it in `exwm-update-class-hook' and `exwm-update-title-hook', which
       ;; are run when a new X window class name or title is available.  Here's
       ;; some advice on this topic:
       ;; + Always use `exwm-workspace-rename-buffer` to avoid naming conflict.
       ;; + For applications with multiple windows (e.g. GIMP), the class names of
       ;; all windows are probably the same.  Using window titles for them makes
       ;; more sense.

       ;; update the buffer name by X11 window title
       (add-hook 'exwm-update-title-hook
                 (lambda ()
                   (when (and (fboundp 'exwm-workspace-rename-buffer)
                              (boundp 'exwm-class-name)
                              (boundp 'exwm-title))
                     (exwm-workspace-rename-buffer
                      (truncate-string-to-width
                       (concat exwm-class-name "|" exwm-title) 32)))))

       (add-hook 'exwm-randr-screen-change-hook
                 (lambda ()
                   (start-process-shell-command
                    "randr" nil eos-xrandr-command)))
       #+END_SRC

****** Enable

       #+BEGIN_SRC emacs-lisp

       ;; enable exwm if graphic display is non-nil
       (when (and (display-graphic-p)
                  (require 'exwm nil t)
                  (require 'exwm-randr nil t))
         (progn
           (exwm-enable)
           (exwm-randr-enable)))

       #+END_SRC

***** Exwm-edit

      A module used to edit fields in a application using a emacs buffer.

****** Require

       #+BEGIN_SRC emacs-lisp

       ;; (require 'exwm-edit nil t)

       #+END_SRC

****** Bind

       #+BEGIN_SRC emacs-lisp
       (when (display-graphic-p)
           (exwm-input-set-key (kbd "C-c '") #'exwm-edit--compose)
           (exwm-input-set-key (kbd "C-c C-'") #'exwm-edit--compose))
       #+END_SRC

** EOF

   *...See You Space Cowboy...*

