src/init.el

;; All buffers created in EXWM mode are named "*EXWM*". You may want to
;; change it in `exwm-update-class-hook' and `exwm-update-title-hook', which
;; are run when a new X window class name or title is available.  Here's
;; some advice on this topic:
;; + Always use `exwm-workspace-rename-buffer` to avoid naming conflict.
;; + For applications with multiple windows (e.g. GIMP), the class names of
;; all windows are probably the same.  Using window titles for them makes
;; more sense.

;; update the buffer name by X11 window title
(add-hook 'exwm-update-title-hook
          (lambda ()
            (when (and (fboundp 'exwm-workspace-rename-buffer)
                       (boundp 'exwm-class-name)
                       (boundp 'exwm-title))
              (exwm-workspace-rename-buffer
               (truncate-string-to-width
                (concat exwm-class-name "|" exwm-title) 32)))))

(add-hook 'exwm-randr-screen-change-hook
          (lambda ()
            (start-process-shell-command
             "randr" nil eos-xrandr-command)))

;; enable exwm if graphic display is non-nil
(when (and (display-graphic-p)
           (require 'exwm nil t)
           (require 'exwm-randr nil t))
  (progn
    (exwm-enable)
    (exwm-randr-enable)))

;; (require 'exwm-edit nil t)

(when (display-graphic-p)
    (exwm-input-set-key (kbd "C-c '") #'exwm-edit--compose)
    (exwm-input-set-key (kbd "C-c C-'") #'exwm-edit--compose))
